# Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\giand\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\giand\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\giand\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\giand\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\giand\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\giand\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

Version

In [2]:
import pandas as pd

print("Pandas version:{}".format(pd.__version__))

Pandas version:2.2.2

## Pandas Series

In [3]:
import pandas as pd

#Definition of serie of floats
serie_1 = pd.Series([1., 2., 3.])

In [4]:
#Print content of serie_1 with index
print ("serie_1:")
print (serie_1)

serie_1:
0    1.0
1    2.0
2    3.0
dtype: float64

In [5]:
#Definition of serie of floats
serie_2 = pd.Series([1., 2., 3.], index=['a', 'b', 'c'])

In [6]:
#Print content of serie_2
print("serie_2:")
print(serie_2)

serie_2:
a    1.0
b    2.0
c    3.0
dtype: float64

## DataFrame

pip install numpy

### Create a dataframe from Numpy Array

In [7]:
import numpy as np
import pandas as pd

#Define 2d NumPy array
arr_2d = [(1,2),(3,4)]

In [8]:
#Convert 2d Numpy array to pandas Data frame
df_arr_2d = pd.DataFrame(arr_2d)

In [9]:
#Print content of df_arr_2d
print("Data Frame:")
print(df_arr_2d)

Data Frame:
   0  1
0  1  2
1  3  4

### Create a dataframe from Dictionary

In [10]:
#Define dictionary dic
dic = {'Name': ["John", "Smith"], 'Age': [30, 40]}

In [11]:
#Convert dictionary to pandas Data Frame
df_dic= pd.DataFrame(dic)

In [12]:
#Print content of df_dic
print("Data Frame with dictionary:")
print(df_dic)

Data Frame with dictionary:
    Name  Age
0   John   30
1  Smith   40

### Create a dataframe from a range of value

In [13]:
import pandas as pd

In [14]:
#Create date using pandas.data_range()
dates_d = pd.date_range('20300101', periods=6, freq='D')

In [15]:
#Print content of dates_d
print('Day:', dates_d)

Day: DatetimeIndex(['2030-01-01', '2030-01-02', '2030-01-03', '2030-01-04',
               '2030-01-05', '2030-01-06'],
              dtype='datetime64[ns]', freq='D')

## Methods with DataFrame

In [16]:
import numpy as np
import pandas as pd

In [17]:
#Create date using pandas.data_range()
dates_m = pd.date_range('20300101', periods=6, freq='M')

#Create a random sequence. The sequence has 4 columns and 6 rows
random = np.random.randn(6,4)

# Use dates_m as an index for the data frame
# # Each row will be given a "name" or an index, corresponding to a date.
df = pd.DataFrame(random, index=dates_m,columns=list('ABCD'))

C:\Users\giand\AppData\Local\Temp\ipykernel_22764\1888933242.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates_m = pd.date_range('20300101', periods=6, freq='M')

How to print the content of the Dataframe

In [18]:
#Print content of df
print("Data Frame:")
df

Data Frame:

                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275
2030-02-28 -0.799910  1.006647  0.282631  0.376301
2030-03-31  0.903355 -0.089329  1.386775  0.573385
2030-04-30 -0.045581 -1.120798  1.131650 -0.477144
2030-05-31  1.497884 -0.896062  0.599296 -0.500316
2030-06-30  0.886852  0.733054  1.532167 -1.366194

Stampa il primo elemento

In [19]:
#Use method tail()
print ("tail:")
df.tail(1)

tail:

                   A         B         C         D
2030-06-30  0.886852  0.733054  1.532167 -1.366194

Stampa le prime righe n

In [20]:
#Use method head()
print("head:")
df.head(n=1)

head:

                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275

Stampa la composizione statistica del Dataframe

In [21]:
#Use method describe()
print ("dataset:")
df.describe()

dataset:

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.489599 -0.286345  0.884593 -0.343707
std    0.811779  0.995251  0.535905  0.714510
min   -0.799910 -1.351584  0.282631 -1.366194
25%    0.089563 -1.064614  0.431105 -0.626286
50%    0.690923 -0.492695  0.865473 -0.488730
75%    0.899230  0.527458  1.322994  0.162939
max    1.497884  1.006647  1.532167  0.573385

Stampa le informazioni sul dataframe

In [22]:
#Use method info()
print ("dataset:")
df.info()

dataset:
<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2030-01-31 to 2030-06-30
Freq: ME
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

Conta le righe

In [23]:
#Use method count()
print ("dataset:")
df.count()

dataset:

A    6
B    6
C    6
D    6
dtype: int64

Print columns using names

In [24]:
#Print column using name
print ("first column:")
print(df['A'])

first column:
2030-01-31    0.494994
2030-02-28   -0.799910
2030-03-31    0.903355
2030-04-30   -0.045581
2030-05-31    1.497884
2030-06-30    0.886852
Freq: ME, Name: A, dtype: float64

In [25]:
#Print column using name
print ("first two colums:")
print(df[['A','B']])

first two colums:
                   A         B
2030-01-31  0.494994 -1.351584
2030-02-28 -0.799910  1.006647
2030-03-31  0.903355 -0.089329
2030-04-30 -0.045581 -1.120798
2030-05-31  1.497884 -0.896062
2030-06-30  0.886852  0.733054

Print row using index

In [26]:
#Print row using index
print ("first row:")
print(df[0:1])

first row:
                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275

In [27]:
#Print row using index
print ("first three rows:")
print(df[0:3])

first three rows:
                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275
2030-02-28 -0.799910  1.006647  0.282631  0.376301
2030-03-31  0.903355 -0.089329  1.386775  0.573385

## Loc Function

In [28]:
#Print rows with attribute A > 0
print ("rows with attribute A > 0:")
print(df.loc[df['A'] > 0])

rows with attribute A > 0:
                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275
2030-03-31  0.903355 -0.089329  1.386775  0.573385
2030-05-31  1.497884 -0.896062  0.599296 -0.500316
2030-06-30  0.886852  0.733054  1.532167 -1.366194

## Drop

Elimina righe o colonne

In [29]:
#Print content of df
print("Data Frame:")
df

Data Frame:

                   A         B         C         D
2030-01-31  0.494994 -1.351584  0.375041 -0.668275
2030-02-28 -0.799910  1.006647  0.282631  0.376301
2030-03-31  0.903355 -0.089329  1.386775  0.573385
2030-04-30 -0.045581 -1.120798  1.131650 -0.477144
2030-05-31  1.497884 -0.896062  0.599296 -0.500316
2030-06-30  0.886852  0.733054  1.532167 -1.366194

In [30]:
#Drop colums A and C from df
df_1=df.drop(columns=['A', 'C'])

In [31]:
#Print content of df_1
print("Data Frame after drop:")
df_1

Data Frame after drop:

                   B         D
2030-01-31 -1.351584 -0.668275
2030-02-28  1.006647  0.376301
2030-03-31 -0.089329  0.573385
2030-04-30 -1.120798 -0.477144
2030-05-31 -0.896062 -0.500316
2030-06-30  0.733054 -1.366194

# Concat

Define First Dataframe

In [32]:
import numpy as np
import pandas as pd

#Define first Data Frame
df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'],'Age': ['25', '30', '50']},index=[0, 1, 2])

In [33]:
#Print content of df1
print("Data Frame 1:")
df1

Data Frame 1:

    name Age
0   John  25
1  Smith  30
2   Paul  50

Define Second Dataframe

In [34]:
#Define second Data Frame
df2 = pd.DataFrame({'name': ['Adam', 'Smith' ],'Age': ['26', '11']},index=[3, 4])

In [35]:
#Print content of df2
print("Data Frame 2:")
df2

Data Frame 2:

    name Age
3   Adam  26
4  Smith  11

Usa il metodo "concat" per concatenare due Dataframe

In [36]:
df_concat = pd.concat([df1,df2])

In [37]:
#Print content of df_concat
print("Data Frame concat:")
print(df_concat)

Data Frame concat:
    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11

## Duplicate e Nan

In caso di tuple duplicate, o valori None o Nan, la librerie ci permette di rimuovere dal dataframe le righe interessate

In [38]:
import numpy as np
import pandas as pd

#Define first Data Frame
df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'],'Age': ['25', '30', '50']},index=[0, 1, 2])

#Define second Data Frame
df2 = pd.DataFrame({'name': ['Adam', 'Smith', None ],'Age': ['26', '11', '15']},index=[3, 4, 5])

df_concat = pd.concat([df1,df2])

#Print content of df_concat
print("Data Frame concat:")
df_concat

Data Frame concat:

    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11
5   None  15

Drop duplicate rows with drop_duplicates()

In [39]:
#Drop duplicate rows with drop_duplicates()
df_concat_nd = df_concat.drop_duplicates()

In [40]:
#Print content of df_concat_nd
print ("Data Frame without duplicate names:")
print(df_concat_nd)

Data Frame without duplicate names:
    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11
5   None  15

Drop NAN Value rows with dropna()

In [42]:
#Drop NAN rows with drop_duplicates()
df_concat_nd = df_concat.dropna()

In [43]:
#Print content of df_concat_nd
print ("Data Frame without duplicate names:")
print(df_concat_nd)

Data Frame without duplicate names:
    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11

## Sort

In [ ]:
import numpy as np
import pandas as pd

#Define first Data Frame
df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'],'Age': ['25', '30', '50']}, index=[0, 1, 2])

#Define second Data Frame
#Print content of df1
print("Data Frame 1:")
df1

In [ ]:
df2 = pd.DataFrame({'name': ['Adam', 'Smith' ],'Age': ['26', '11']},index=[3, 4])

#Print content of df2
print("Data Frame 2:")
df2

In [ ]:
df_concat = pd.concat([df1,df2])

In [ ]:
#Print content of df_concat
print("Data Frame concat:")
df_concat

Sorting values by Age

In [ ]:
#Sorting values by Age
df_concat_st = df_concat.sort_values('Age')

In [ ]:
#Print content of df_concat_st
print("Data Frame sorting by Age: ")
df_concat_st

## Rename Column

In [ ]:
#Rename Data Frame
df_concat_rename = df_concat.rename(columns={"name": "Surname", "Age": "Age_ppl"})

In [ ]:
#Print content of df_concat_remane
print("Data Frame after remane: ")
df_concat_rename

## Import from URL

In [44]:
import pandas as pd

#Define attributes of CSV file
COLUMNS = ['age','workclass', 'fnlwgt', 'education', 'education_num','marital', 'occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_week', 'native_country', 'label']

#Define path of CSV file
PATH = "https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data"
df_train = pd.read_csv(PATH, skipinitialspace=True, names = COLUMNS, index_col=False)

#Print shape of df_train
print("df_train shape: {} ".format(df_train.shape))

df_train shape: (32561, 15)

## Group By

In [45]:
import pandas as pd

#Define attributes of CSV file
COLUMNS = ['age','workclass', 'fnlwgt', 'education', 'education_num', 	'marital', 'occupation', 'relationship', 'race', 'sex','capital_gain', 'capital_loss', 'hours_week', 'native_country','label']

#Define path of CSV file
PATH = "https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data"
df_train = pd.read_csv(PATH, skipinitialspace=True, names = COLUMNS, index_col=False)

Media

In [49]:
#Application of groupby() function
df_gb = df_train.groupby(['label']).mean(numeric_only=True)

In [50]:
#Print content of df_gb
print ("Data Frame after groupby:")
df_gb

Data Frame after groupby:

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_week
label,,,,,,
<=50K,36.783738,190340.86517,9.595065,148.752468,53.142921,38.840210
>50K,44.249841,188005.00000,11.611657,4006.142456,195.001530,45.473026

Minimo

In [51]:
#Application of groupby() function
df_gb = df_train.groupby(['label'])['age'].min()

#Print content of df_gb
print ("Data Frame after groupby:")
df_gb

Data Frame after groupby:

label
<=50K    17
>50K     19
Name: age, dtype: int64

Massimo

In [52]:
#Application of groupby() function
df_gb = df_train.groupby(['label', 'marital'])['capital_gain'].max()

#Print content of df_gb
print ("Data Frame after groupby:")
df_gb

Data Frame after groupby:

label  marital
<=50K  Divorced                 34095
       Married-AF-spouse         2653
       Married-civ-spouse       41310
       Married-spouse-absent     6849
       Never-married            34095
       Separated                 7443
       Widowed                   6849
>50K   Divorced                 99999
       Married-AF-spouse         7298
       Married-civ-spouse       99999
       Married-spouse-absent    99999
       Never-married            99999
       Separated                99999
       Widowed                  99999
Name: capital_gain, dtype: int64